# Introduction

In this notebook I show the different join in Postgresql. You can copy/paste this cell in some sql service like http://sqlfiddle.com/ and do interactive queries.

## Schema

Copy and paste the next code in the left side ("Schema Panel"), and click on "Build Schema".

CREATE TABLE COMPANY(  
   ID INT PRIMARY KEY     NOT NULL,  
   NAME           TEXT    NOT NULL,  
   AGE            INT     NOT NULL,  
   ADDRESS        CHAR(50)  
);  
-- - - - - - - - - - -  - - - - - -
CREATE TABLE DEPARTMENT(  
   ID INT PRIMARY KEY      NOT NULL,  
   DEPT           CHAR(50) NOT NULL,  
   EMP_ID         INT      NOT NULL  
);  
-- - - - - - - - - - -  - - - - - -
INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS)   
VALUES   
(1, 'Paul', 32, 'California'),  
(2, 'Allen', 25, 'Texas'),  
(3, 'Teddy', 23, 'Norway'),  
(4, 'Mark', 25, 'Rich-Mond'),  
(5, 'David', 27, 'Texas');      
-- - - - - - - - - - -  - - - - - -
INSERT INTO DEPARTMENT (ID, DEPT, EMP_ID)    
VALUES     
(1, 'IT Billing', 1 ),    
(2, 'Engineering', 2 ),    
(3, 'Finance', 7 );

Now will be active the rigth side ("Query Panel"). Copy and paste the next code:

-- Case 0  
SELECT 'CROSS JOIN' as type, 
  COMPANY.id,name,age,address,DEPARTMENT.id,dept,emp_id  
FROM DEPARTMENT, COMPANY  
ORDER BY COMPANY.ID;  

------------------------------------------------  
-- Case 0B  
SELECT 'JOIN (no restriction)' as type, 
  COMPANY.id,name,age,address,DEPARTMENT.id,dept,emp_id  
FROM DEPARTMENT, COMPANY  
ORDER BY COMPANY.ID;  

------------------------------------------------  
-- Case 1  
SELECT 'INNER JOIN' as type, -- 1  
  COMPANY.id,name,age,address,DEPARTMENT.id,dept,emp_id  
FROM COMPANY INNER JOIN DEPARTMENT  
        ON COMPANY.ID = DEPARTMENT.EMP_ID  
        ORDER BY COMPANY.ID;  

------------------------------------------------  
-- Case 2  
SELECT 'LEFT JOIN' as type, -- 2  
  COMPANY.id,name,age,address,DEPARTMENT.id,dept,emp_id  
FROM COMPANY LEFT JOIN DEPARTMENT  
        ON COMPANY.ID = DEPARTMENT.EMP_ID  
        ORDER BY COMPANY.ID;  

------------------------------------------------  
-- Case 3  
SELECT 'RIGHT JOIN' as type, -- 3  
  COMPANY.id,name,age,address,DEPARTMENT.id,dept,emp_id  
FROM COMPANY RIGHT JOIN DEPARTMENT  
        ON COMPANY.ID = DEPARTMENT.EMP_ID  
        ORDER BY COMPANY.ID;  

------------------------------------------------  
-- Case 4  
SELECT 'FULL OUTER JOIN' as type, -- 4  
  COMPANY.id,name,age,address,DEPARTMENT.id,dept,emp_id  
FROM COMPANY FULL OUTER JOIN DEPARTMENT  
        ON COMPANY.ID = DEPARTMENT.EMP_ID  
        ORDER BY COMPANY.ID;  

------------------------------------------------

## Explanation

### CROSS JOIN

In this case create a relation between each element on the first table with each element in the second table.

-- Case 0  
SELECT 'CROSS JOIN' as type,
  COMPANY.id,name,age,address,DEPARTMENT.id,dept,emp_id  
FROM DEPARTMENT CROSS JOIN COMPANY  
ORDER BY COMPANY.ID;

|type|id | name |	age |	address | id | dept |emp_id  |  
|----|----|----|----|----|----|----|----|
| CROSS JOIN | 1 | Paul | 32 | California | 1 | IT Billing | 1|
| CROSS JOIN | 1 | Paul | 32 | California | 2 | Engineering | 2|
| CROSS JOIN | 1 | Paul | 32 | California | 3 | Finance | 7|
| CROSS JOIN | 2 | Allen | 25 | Texas | 1 | IT Billing | 1|
| CROSS JOIN | 2 | Allen | 25 | Texas | 2 | Engineering | 2|
| CROSS JOIN | 2 | Allen | 25 | Texas | 3 | Finance | 7|
| CROSS JOIN | 3 | Teddy | 23 | Norway | 1 | IT Billing | 1|
| CROSS JOIN | 3 | Teddy | 23 | Norway | 2 | Engineering | 2|
| CROSS JOIN | 3 | Teddy | 23 | Norway | 3 | Finance | 7|
| CROSS JOIN | 4 | Mark | 25 | Rich-Mond | 1 | IT Billing | 1|
| CROSS JOIN | 4 | Mark | 25 | Rich-Mond | 2 | Engineering | 2|
| CROSS JOIN | 4 | Mark | 25 | Rich-Mond | 3 | Finance | 7|
| CROSS JOIN | 5 | David | 27 | Texas | 1 | IT Billing | 1|
| CROSS JOIN | 5 | David | 27 | Texas | 2 | Engineering | 2|
| CROSS JOIN | 5 | David | 27 | Texas | 3 | Finance | 7|

The text "CROSS JOIN" could be replaced with just a "," too

-- Case 0B  
SELECT 'JOIN (no restriction)' as type, 
  COMPANY.id,name,age,address,DEPARTMENT.id,dept,emp_id  
FROM DEPARTMENT, COMPANY  
ORDER BY COMPANY.ID;

|type|id | name |	age |	address | id | dept |emp_id  |  
|----|----|----|----|----|----|----|----|
| JOIN (no restriction) | 1 | Paul | 32 | California | 1 | IT Billing | 1|
| JOIN (no restriction) | 1 | Paul | 32 | California | 2 | Engineering | 2|
| JOIN (no restriction) | 1 | Paul | 32 | California | 3 | Finance | 7|
| JOIN (no restriction) | 2 | Allen | 25 | Texas | 1 | IT Billing | 1|
| JOIN (no restriction) | 2 | Allen | 25 | Texas | 2 | Engineering | 2|
| JOIN (no restriction) | 2 | Allen | 25 | Texas | 3 | Finance | 7|
| JOIN (no restriction) | 3 | Teddy | 23 | Norway | 1 | IT Billing | 1|
| JOIN (no restriction) | 3 | Teddy | 23 | Norway | 2 | Engineering | 2|
| JOIN (no restriction) | 3 | Teddy | 23 | Norway | 3 | Finance | 7|
| JOIN (no restriction) | 4 | Mark | 25 | Rich-Mond | 1 | IT Billing | 1|
| JOIN (no restriction) | 4 | Mark | 25 | Rich-Mond | 2 | Engineering | 2|
| JOIN (no restriction) | 4 | Mark | 25 | Rich-Mond | 3 | Finance | 7|
| JOIN (no restriction) | 5 | David | 27 | Texas | 1 | IT Billing | 1|
| JOIN (no restriction) | 5 | David | 27 | Texas | 2 | Engineering | 2|
| JOIN (no restriction) | 5 | David | 27 | Texas | 3 | Finance | 7|

### INNER JOIN

In this case just take the element that exist in both, first and second table

-- Case 1  
SELECT 'INNER JOIN' as type,  
  COMPANY.id,name,age,address,DEPARTMENT.id,dept,emp_id  
FROM COMPANY INNER JOIN DEPARTMENT  
        ON COMPANY.ID = DEPARTMENT.EMP_ID  
        ORDER BY COMPANY.ID;

|type|id | name |	age |	address | id | dept |emp_id  |  
|----|----|----|----|----|----|----|----|
|INNER JOIN | 1 |	Paul |	32 | California | 1 |IT Billing | 1  |  
|INNER JOIN | 2 |	Allen |	25 | Texas | 2 |Engineering | 2  |

### LEFT JOIN

In this case take all the elements in the first table (the "left"), and add matched elements in the second table (the "right")

-- Case 2  
SELECT 'LEFT JOIN' as type,   
  COMPANY.id,name,age,address,DEPARTMENT.id,dept,emp_id  
FROM COMPANY LEFT JOIN DEPARTMENT  
        ON COMPANY.ID = DEPARTMENT.EMP_ID  
        ORDER BY COMPANY.ID;

|type|id | name |	age |	address | id | dept |emp_id  |  
|----|----|----|----|----|----|----|----|
|LEFT JOIN | 1 | Paul | 32 | California	| 1	| IT Billing | 1|
|LEFT JOIN | 2 | Allen | 25 | Texas	| 2 |	Engineering | 2|
|LEFT JOIN | 3 | Teddy | 23 | Norway	| (null) | (null) | (null)|
|LEFT JOIN | 4 | Mark | 25 | Rich -Mond| (null) | (null) | (null)|
|LEFT JOIN | 5 | David | 27 | Texas	| (null) | (null) | (null)|

### RIGHT JOIN

This is opposite the previous. In this case take all the elements in the second table (the "right"), and add matched elements in the first table (the "left")

-- Case 3  
SELECT 'RIGHT JOIN' as type,   
  COMPANY.id,name,age,address,DEPARTMENT.id,dept,emp_id  
FROM COMPANY RIGHT JOIN DEPARTMENT  
        ON COMPANY.ID = DEPARTMENT.EMP_ID  
        ORDER BY COMPANY.ID;

|type|id | name |	age |	address | id | dept |emp_id  |  
|----|----|----|----|----|----|----|----|
|RIGHT JOIN| 1 | Paul | 32 | California	1 | IT | Billing | 1|
|RIGHT JOIN| 2 | Allen | 25 | Texas | 2 | Engineering | 2|
|RIGHT JOIN| (null)| (null) | (null) | (null) | 3 | Finance	| 7|

### FULL OUTER JOIN

In this case take all the elements in the first table (the "left"), and try to match with elements in the second table (the "right"), but if an element doesn't  exist, it is replaced with 'null'

-- Case 4  
SELECT 'FULL OUTER JOIN' as type,   
  COMPANY.id,name,age,address,DEPARTMENT.id,dept,emp_id  
FROM COMPANY FULL OUTER JOIN DEPARTMENT  
        ON COMPANY.ID = DEPARTMENT.EMP_ID  
        ORDER BY COMPANY.ID;

|type|id | name |	age |	address | id | dept |emp_id  |  
|----|----|----|----|----|----|----|----|
|FULL OUTER JOIN | 1 | Paul | 32 | California | 1 | IT Billing | 1|
|FULL OUTER JOIN | 2 | Allen | 25 | Texas | 2 | Engineering | 2|
|FULL OUTER JOIN | 3 | Teddy | 23 | Norway | (null) | (null) | (null)|
|FULL OUTER JOIN | 4 | Mark | 25 | Rich-Mond | (null) | (null) | (null)|
|FULL OUTER JOIN | 5 | David | 27 | Texas | (null) | (null) | (null)|
|FULL OUTER JOIN | (null) | (null) | (null) | (null) | 3 | Finance | 7|